diagram readme
Add a Visual Diagram in the Readme.md file
